stephenshizl/tanker-flow-mcu/Utilities/SVD/APM32F051.svd
                <register>
                    <name>PUPD</name>
                    <displayName>PUPD</displayName>
                    <description>GPIO port pull-up/pull-down register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PUPD15</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD14</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD13</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD12</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD11</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD10</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD9</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD8</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD7</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD6</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD5</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD4</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD3</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD2</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD1</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUPD0</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDATA</name>
                    <displayName>IDATA</displayName>
                    <description>GPIO port input data register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDATA15</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA14</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA13</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA12</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA11</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA10</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA9</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA8</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA7</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA6</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA5</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA4</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA3</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA2</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA1</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDATA0</name>
                            <description>Port input data (y =
 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ODATA</name>
                    <displayName>ODATA</displayName>
                    <description>GPIO port output data register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ODATA15</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA14</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA13</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA12</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA11</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA10</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA9</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA8</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA7</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA6</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA5</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA4</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA3</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA2</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA1</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODATA0</name>
                            <description>Port output data (y =
 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
