stephenshizl/tanker-flow-mcu/Utilities/SVD/APM32F051.svd
                <register>
                    <name>BR</name>
                    <displayName>BR</displayName>
                    <description>Port bit clear register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BR0</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR1</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR2</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR3</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR4</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR5</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR6</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR7</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR8</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR9</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR10</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR11</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR12</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR13</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR14</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR15</name>
                            <description>Port x clear bit y</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="GPIOF">
            <name>GPIOD</name>
            <baseAddress>0x48000C00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOF">
            <name>GPIOC</name>
            <baseAddress>0x48000800</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOF">
            <name>GPIOB</name>
            <baseAddress>0x48000400</baseAddress>
        </peripheral>
        <peripheral>
            <name>GPIOA</name>
            <description>General-purpose I/Os</description>
            <groupName>GPIO</groupName>
            <baseAddress>0x48000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MODE</name>
                    <displayName>MODE</displayName>
                    <description>GPIO port mode register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x28000000</resetValue>
                    <fields>
                        <field>
                            <name>MODE15</name>
                            <description>Port x configuration bits (y = 0..15)</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE14</name>
                            <description>Port x configuration bits (y = 0..15)</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE13</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE12</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE11</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE10</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE9</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE8</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE7</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE6</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE5</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE4</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE3</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE2</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE1</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MODE0</name>
                            <description>Port x configuration bits (y = 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OMODE</name>
                    <displayName>OMODE</displayName>
                    <description>GPIO port output type register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OMODE15</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE14</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE13</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE12</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE11</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE10</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE9</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE8</name>
                            <description>Port x configuration bits (y = 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE7</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE6</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE5</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE4</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE3</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE2</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE1</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OMODE0</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OSSEL</name>
                    <displayName>OSSEL</displayName>
                    <description>GPIO port output speed register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0C000000</resetValue>
                    <fields>
                        <field>
                            <name>OSSEL15</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL14</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL13</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL12</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL11</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL10</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL9</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL8</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL7</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL6</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL5</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL4</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL3</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL2</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL1</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OSSEL0</name>
                            <description>Port x configuration bits (y =
 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
