stephenshizl/tanker-flow-mcu/Utilities/SVD/APM32F051.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DBG</name>
            <description>Debug support</description>
            <groupName>DBG</groupName>
            <baseAddress>0x40015800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>IDCODE</name>
                    <displayName>IDCODE</displayName>
                    <description>MCU Device ID Code Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EQR</name>
                            <description>Device Identifier</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>WVR</name>
                            <description>Revision Identifier</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>Debug MCU Configuration
          Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>STOP_CLK_STS</name>
                            <description>Debug Stop Mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STANDBY_CLK_STS</name>
                            <description>Debug Standby Mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB1F</name>
                    <displayName>APB1F</displayName>
                    <description>APB Low Freeze Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TMR2_STS</name>
                            <description>Debug Timer 2 stopped when Core is halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR3_STS</name>
                            <description>Debug Timer 3 stopped when Core is halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR6_STS</name>
                            <description>Debug Timer 6 stopped when Core is halted</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR14_STS</name>
                            <description>Debug Timer 14 stopped when Core is halted</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_STS</name>
                            <description>Debug RTC stopped when Core is halted</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDT_STS</name>
                            <description>Debug Window Wachdog stopped when Core is halted</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDT_STS</name>
                            <description>Debug Independent Wachdog stopped when Core is halted</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1_SMBUS_TIMEOUT_STS</name>
                            <description>I2C1 SMBUS timeout mode stopped when Core is halted</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB2F</name>
                    <displayName>APB2F</displayName>
                    <description>APB High Freeze Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TMR1_STS</name>
                            <description>Debug Timer 1 stopped when Core is halted</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR15_STS</name>
                            <description>Debug Timer 15 stopped when Core is halted</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR16_STS</name>
                            <description>Debug Timer 16 stopped when Core is halted</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR17_STS</name>
                            <description>Debug Timer 17 stopped when Core is halted</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
