stephenshizl/tanker-flow-mcu/Utilities/SVD/APM32F051.svd
                <register>
                    <name>DCTRL</name>
                    <displayName>DCTRL</displayName>
                    <description>DMA control register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>DBLEN</name>
                            <description>DMA burst length</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DBADDR</name>
                            <description>DMA base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMADDR</name>
                    <displayName>DMADDR</displayName>
                    <description>DMA address for full transfer</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>DMADDR</name>
                            <description>DMA register for burst
              accesses</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>TMR16</name>
            <description>General-purpose-timers</description>
            <groupName>TMR</groupName>
            <baseAddress>0x40014400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR16</name>
                <description>TMR16 global Interrupt</description>
                <value>21</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL1</name>
                    <displayName>CTRL1</displayName>
                    <description>control register 1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CLKDIV</name>
                            <description>Clock division</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ARPEN</name>
                            <description>Auto-reload preload enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPMEN</name>
                            <description>One-pulse mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>URSSEL</name>
                            <description>Update request source</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UD</name>
                            <description>Update disable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNTEN</name>
                            <description>Counter enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>control register 2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>OC1NOIS</name>
                            <description>Output Idle state 1</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC1OIS</name>
                            <description>Output Idle state 1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCDSEL</name>
                            <description>Capture/compare DMA
              selection</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCUSEL</name>
                            <description>Capture/compare control update
              selection</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCPEN</name>
                            <description>Capture/compare preloaded
              control</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEN</name>
                    <displayName>DIEN</displayName>
                    <description>DMA/Interrupt enable register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CC1DEN</name>
                            <description>Capture/Compare 1 DMA request
              enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UDIEN</name>
                            <description>Update DMA request enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRKIEN</name>
                            <description>Break interrupt enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMIEN</name>
                            <description>COM interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1IEN</name>
                            <description>Capture/Compare 1 interrupt
              enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UIEN</name>
                            <description>Update interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CC1RCFLG</name>
                            <description>Capture/Compare 1 overcapture
              flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRKIFLG</name>
                            <description>Break interrupt flag</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMIFLG</name>
                            <description>COM interrupt flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1IFLG</name>
                            <description>Capture/compare 1 interrupt
              flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UIFLG</name>
                            <description>Update interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CEG</name>
                    <displayName>CEG</displayName>
                    <description>event generation register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>BEG</name>
                            <description>Break generation</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMG</name>
                            <description>Capture/Compare control update
              generation</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1EG</name>
                            <description>Capture/compare 1
              generation</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UEG</name>
                            <description>Update generation</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCM1_OUTPUT</name>
                    <displayName>CCM1_OUTPUT</displayName>
                    <description>capture/compare mode register (output
          mode)</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OC1MOD</name>
                            <description>Output Compare 1 mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OC1PEN</name>
                            <description>Output Compare 1 preload
              enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC1FEN</name>
                            <description>Output Compare 1 fast
              enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1SEL</name>
                            <description>Capture/Compare 1
              selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCM1_INPUT</name>
                    <displayName>CCM1_INPUT</displayName>
                    <description>capture/compare mode register 1 (input
          mode)</description>
                    <alternateRegister>CCM1_OUTPUT</alternateRegister>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IC1F</name>
                            <description>Input capture 1 filter</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>IC1PSC</name>
                            <description>Input capture 1 prescaler</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CC1SEL</name>
                            <description>Capture/Compare 1
              selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCEN</name>
                    <displayName>CCEN</displayName>
                    <description>capture/compare enable
          register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CC1NPOL</name>
                            <description>Capture/Compare 1 output
              Polarity</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1NEN</name>
                            <description>Capture/Compare 1 complementary output
              enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1POL</name>
                            <description>Capture/Compare 1 output
              Polarity</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1EN</name>
                            <description>Capture/Compare 1 output
              enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNT</name>
                    <displayName>CNT</displayName>
                    <description>counter</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>counter value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSC</name>
                    <displayName>PSC</displayName>
                    <description>prescaler</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>Prescaler value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AUTORLD</name>
                    <displayName>AUTORLD</displayName>
                    <description>auto-reload register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <fields>
                        <field>
                            <name>AUTORLD</name>
                            <description>Auto-reload value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REPCNT</name>
                    <displayName>REPCNT</displayName>
                    <description>repetition counter register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>REPCNT</name>
                            <description>Repetition counter value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CC1</name>
                    <displayName>CC1</displayName>
                    <description>capture/compare register 1</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC1</name>
                            <description>Capture/Compare 1 value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
