stephenshizl/tanker-flow-mcu/Utilities/SVD/APM32F051.svd
                <register>
                    <name>BDT</name>
                    <displayName>BDT</displayName>
                    <description>break and dead-time register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MOEN</name>
                            <description>Main output enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AOEN</name>
                            <description>Automatic output enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRKPOL</name>
                            <description>Break polarity</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRKEN</name>
                            <description>Break enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMOS</name>
                            <description>Off-state selection for Run
              mode</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMOS</name>
                            <description>Off-state selection for Idle
              mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCKCFG</name>
                            <description>Lock configuration</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DTS</name>
                            <description>Dead-time generator setup</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCTRL</name>
                    <displayName>DCTRL</displayName>
                    <description>DMA control register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>DBLEN</name>
                            <description>DMA burst length</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DBADDR</name>
                            <description>DMA base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMADDR</name>
                    <displayName>DMADDR</displayName>
                    <description>DMA address for full transfer</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>DMADDR</name>
                            <description>DMA register for burst
              accesses</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="TMR16">
            <name>TMR17</name>
            <baseAddress>0x40014800</baseAddress>
            <interrupt>
                <name>TMR17</name>
                <description>TMR17 global Interrupt</description>
                <value>22</value>
            </interrupt>
        </peripheral>
    </peripherals>
</device>
